; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-1-252)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p0-6 - location
	p5-0 - location
	p4-3 - location
	p4-5 - location
	p1-2 - location
	p6-1 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s6)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s6)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 45)
	(= (time-to-walk p0-2 s0) 45)
	(= (time-to-walk s2 p0-2) 54)
	(= (time-to-walk p0-2 s2) 54)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 35)
	(= (time-to-walk p0-3 s0) 35)
	(= (time-to-walk s3 p0-3) 1)
	(= (time-to-walk p0-3 s3) 1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 48)
	(= (time-to-walk p0-4 s0) 48)
	(= (time-to-walk s4 p0-4) 15)
	(= (time-to-walk p0-4 s4) 15)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 44)
	(= (time-to-walk p0-6 s0) 44)
	(= (time-to-walk s6 p0-6) 9)
	(= (time-to-walk p0-6 s6) 9)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 63)
	(= (time-to-walk p5-0 s5) 63)
	(= (time-to-walk s0 p5-0) 45)
	(= (time-to-walk p5-0 s0) 45)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 48)
	(= (time-to-walk p4-3 s4) 48)
	(= (time-to-walk s3 p4-3) 25)
	(= (time-to-walk p4-3 s3) 25)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 63)
	(= (time-to-walk p4-5 s4) 63)
	(= (time-to-walk s5 p4-5) 16)
	(= (time-to-walk p4-5 s5) 16)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 65)
	(= (time-to-walk p1-2 s1) 65)
	(= (time-to-walk s2 p1-2) 42)
	(= (time-to-walk p1-2 s2) 42)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 58)
	(= (time-to-walk p6-1 s6) 58)
	(= (time-to-walk s1 p6-1) 33)
	(= (time-to-walk p6-1 s1) 33)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 51)
	(= (time-to-drive s3 s2) 51)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 41)
	(= (time-to-drive s6 s2) 41)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 48)
	(= (time-to-drive s0 s5) 48)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 25)
	(= (time-to-drive s2 s5) 25)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 30)
	(= (time-to-drive s4 s5) 30)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 4)
	(= (time-to-drive s5 s1) 4)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 43)
	(= (time-to-drive s1 s3) 43)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 45)
	(= (time-to-drive s0 s4) 45)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 22)
	(= (time-to-drive s1 s4) 22)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 47)
	(= (time-to-drive s2 s4) 47)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 34)
	(= (time-to-drive s0 s6) 34)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 24)
	(= (time-to-drive s4 s6) 24)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 31)
	(= (time-to-drive s5 s6) 31)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 18)
	(= (time-to-drive s1 s0) 18)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 4)
	(= (time-to-drive s2 s0) 4)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s3)
	(at truck1 s3)
	(at truck3 s3)
	(at package1 s4)
	))

(:metric minimize (+ (* 3 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver1 s6 p0-6)
   deleted: (at driver1 s6)
   added: (at driver1 p0-6)
   goals met: 2 of 5
2. (walk driver1 p0-6 s0)
   deleted: (at driver1 p0-6)
   added: (at driver1 s0)
   goals met: 3 of 5
3. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   goals met: 3 of 5
4. (board-truck driver5 truck1 s6)
   deleted: (at driver5 s6) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 3 of 5
5. (drive-truck truck1 s6 s2 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 410
   goals met: 3 of 5
6. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   goals met: 3 of 5
7. (drive-truck truck1 s2 s3 driver5)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 410 to 920
   goals met: 4 of 5
8. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 5
9. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 920 to 1430
   goals met: 4 of 5
10. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 5 of 5
